PotluckyGopher/app/views/items/_single.html.erb

<% @event.event_items.each do |ei| %>
---
SELECT "event_items".* FROM "event_items" WHERE "event_items"."event_id" = 1