PotluckyGopher/app/controllers/assigned_items_controller.rb

def create
  @assigned_item = AssignedItem.new(params[:assigned_item])
  @event = Event.find(EventItem.find(@assigned_item.event_item_id).event_id)
  if @assigned_item.save
---
SELECT "event_items".* FROM "event_items" WHERE "event_items"."id" = $1 LIMIT 1  [["id", 11]]
SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT 1  [["id", 4]]
INSERT INTO "assigned_items" ("event_item_id", "guest_email", "guest_name", "quantity_provided", "url") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["event_item_id", 11], ["guest_email", "ben@benji.com"], ["guest_name", "Ben"], ["quantity_provided", 10], ["url", nil]]