PotluckyGopher/app/controllers/events_controller.rb

  def new
    @event = Event.new
    @items = Item.all
---
SELECT "items".* FROM "items"

  def create
    @event = Event.create(params[:event], url: SecureRandom.urlsafe_base64, user_id: current_user.id)
---
INSERT INTO "events" ("created_at", "date", "description", "end_time", "host_provided", "location", "name", "start_time", "type", "updated_at", "url", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"

  def update
    @event = Event.find(params[:id])
    if @event.update_attributes(params[:event])
---
SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT 1  [["id", "4"]]
UPDATE "events" SET "name" = 'Final Presentation', "updated_at" = '2013-06-14 22:52:12.696910' WHERE "events"."id" = 4