PotluckyGopher/app/controllers/items_controller.rb

INSERT INTO "items" ("created_at", "event_id", "name", "suggestion", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Fri, 14 Jun 2013 23:45:39 UTC +00:00], ["event_id", nil], ["name", ""], ["suggestion", ""], ["updated_at", Fri, 14 Jun 2013 23:45:39 UTC +00:00]]
---
  def create
    p "Item Saved!!!!!!!!!!!!!"
    @item = Item.new(params[:item])
    if @item.save