PotluckyGopher/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "6"]]
SELECT "events".* FROM "events" WHERE (date >= '2013-06-15')
---
  def show
    @user = User.find(params[:id])
    @upcoming_events = Event.where("user_id=?", current_user.id) && Event.where("date >= ?", Date.today)

INSERT INTO "users" ("created_at", "email", "name", "oauth_expires_at", "oauth_token", "password_digest", "provider", "uid", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @user = User.new(params[:user])
    if @user.save