PotluckyGopher/app/views/users/show.html.erb

</div>
			<% if current_user.events.any? %>
---
SELECT "events".* FROM "events" WHERE (date >= '2013-06-15')