PotluckyGopher/app/views/events/show.html.erb

SELECT "items".* FROM "items" INNER JOIN "event_items" ON "items"."id" = "event_items"."item_id" WHERE "event_items"."event_id" = 5
---
  <div class="added_items">
    <% @event.items.each do |i| %>